{
  "main": {
    "name": "Mahmoud Jouny",
    "occupation": " Full Stack Software Engineer",
    "description": " currently not employed //freelancer ",
    "employer": "freelancer",
    "jobDescription": "push pixels, shuffle data, and slap my keyboard until everything works 😁 ",
    "image": "profile_pic.jpg",
    "bio": "I am an athlete at heart, with an entrepreneurial spirit, a knack fo r iot, and a passion for coding. Born in a small town of 'lattakia, syria' I am moving to UAE where I will be looking for work as a full stack developer , alongside my many ongoing projects. I love to create and tend to keep a few too many projects on the go at a time. Outside of work I am an soccer player and content creator. I love to travel and lead a fairly nomadic lifestyle. I built much of my early portfolio from mountain of slenfia,lattakia and dream of being able to take my work with me while travelling the world.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "mahmoudjouny99@gmail.com",
    "phone": "(963) 938261614",
    "address": {
      "street": "al herish st",
      "city": "lattakia",
      "country": "syria",
      "zip": "041"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "https://drive.google.com/file/d/13ue9eg-qWeEY6GhN7dW0afDYQS70nyXI/view",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/profile.php?id=100010003903953",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/mahmoud-jouny-5611b4248/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/mhmodjoney",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a tinkerer and am always interested in playing around with new technologies but these are the ones that have really won me over",
    "education": [
      {
        "school": "University of Tishreen",
        "degree": "Bachelors in Computer Science and automatic control",
        "graduated": "Expected April 2022",
        "description": "---------."
      }
    ],
    "work": [
      {
        "company": "Robtic Minde",
        "title": "Full Stack Software Engineer",
        "years": "October 2021 - 2022",
        "description": "At Robtic Minde Creating database and stored procedure using SQL server. Implementing API using ASP.NET (core) and deploying it.   Worked on several DataBases and projects such E-Commerce website and delivery app.   Training interns on SQL and ASP.NET "
      },
      {
        "company": "freelance",
        "title": "Full Stack Software Engineer",
        "years": "October 2022 - present",
        "description": "online using wordprees or mern stack "
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for almost all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image": "git.jpg"
      },
      {
        "name": "c#",
        "description": "c# was one of my first programming language that I started using in college years ago. I used it with asp.net /core to bulide desktop and web apps.",
        "image": "c.jpg"
      },
      {
        "name": "React Js",
        "description": "I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website  ",
        "image": "react.jpg"
      },
      {
        "name": "mysql db",
        "description": "asdsadsadsadsadsad dsadsajldnsaljknd asfljbsnafkjlasfkj aslfjabnkfjbsakjfb saldjnsaljkfbnsan askjdbf I enjoy mysql for it's my first db language i have ever learned",
        "image": "mysql.png"
      },
      {
        "name": "Node JS",
        "description": "Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with ReactJS-based projects",
        "image": "node.jpg"
      },
      {
        "name": "python ",
        "description": "I use python for fun project  regarging ai and cool iot things espaically that i use node mcu and arduino to do cool staff with all of them",
        "image": "python.png"
      },
      {
        "name": "MongoDB",
        "description": "I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image": "mongo.jpg"
      },
      {
        "name": "WordPress",
        "description": "I love WordPress for its versatility and user-friendly interface, allowing me to create stunning websites with ease",
        "image": "WordPress.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Al Saham Al Asfar Typing Center",
        "category": "Al Saham Al Asfar Typing Center (ASATC) is a government transaction center that offers services related to visas, permits, and regulatory requirements for individuals and businesses in the United Arab Emirates",
        "image": "alsahm.png",
        "url": "https://alsahamtypingcenter.ae/"
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Original Thai Food",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "original-thai-food.jpg",
        "url": "https://original-thai-food.herokuapp.com/index.html"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": "https://github.com/tbakerx/react-resume-template"
      },
      {
        "title": "Smirkspace",
        "category": "(MVP Only) A React and Meteor based chat University project.",
        "image": "smirkspace.jpg",
        "url": "http://www.smirkspace.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I have had the opportunity to play with MJ on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude. MJ excels at communicating with others and is always willing to work hard until he solves the problem at hand.",
        "user": "karim benzema"
      }
    ]
  }
}