{
  "main": {
    "name": "Mahmoud Jouny",
    "occupation": " Full Stack Software Engineer",
    "description": " currently not employed //freelancer ",
    "employer": "",
    "jobDescription": "push pixels, shuffle data, and slap my keyboard until everything works 😁 ",
    "image": "profile_pic.jpg",
    "bio": "Experienced backend developer with a passion for continuous learning and growth. Recently relocated to UAE and actively seeking new opportunities in the region. I have two years of professional experience in backend development, specializing in technologies such as ASP.NET (core), SQL, and JavaScript. I thrive in dynamic environments and enjoy taking on new challenges. I am eager to contribute my skills and knowledge to a forward-thinking company and contribute to their success. Please feel free to reach out for more information or to view my CV. Let's connect and explore potential collaborations",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "mahmoudjouny99@gmail.com",
    "phone": "(+971)56 712 5726",
    "address": {
      "street": "",
      "city": "DUBAI",
      "country": "UAE"
    },
    "website": "https://mahmoud-jouny.onrender.com/",
    "resumedownload": "https://www.mediafire.com/file/tgmfasagj8auv7i/mahmoud_jouny.pdf/file",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/profile.php?id=100010003903953",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/mahmoud-jouny-5611b4248/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/mhmodjoney",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a tinkerer and am always interested in playing around with new technologies but these are the ones that have really won me over",
    "education": [
      {
        "school": "University of Tishreen",
        "degree": "Bachelors in Computer Science and automatic control",
        "graduated": " April 2022",
        "description": "---------."
      }
    ],
    "work": [
      {
        "company": "Golden Click Digital Marketing & Branding Agency",
        "title": "Full Stack developer",
        "years": " Dec 2022 - Jun 2023 · 7 mos",
        "description": "Created user-friendly websites, control panels, and interactive UIs using React and WordPress, delivering engaging experiences for users and efficient management capabilities. Successfully worked on various projects utilizing WordPress, React, and Node.js. Developed backends for front applications using Node.js, enabling secure data exchange and seamless integration with third-party services. "
      },
      {
        "company": "Robtic Mind",
        "title": "Full Stack developer",
        "years": "May 2021 - Jun 2022 · 1 yr 2 mos",
        "description": "Successfully worked on various projects using ASP.NET Core framework. Developed a backend for mobile applications using ASP.NET Core, allowing secure data exchange and integration with third-party services. Created user-friendly websites and control panels using ASP.NET Core, providing seamless experiences for users and efficient management capabilities."
      },
      {
        "company": "freelance",
        "title": "Full Stack Software Engineer",
        "years": "October 2022 - present",
        "description": "online using wordprees or mern stack "
      }
    ],
    "skilsnotused": [
      {
        "name": "python ",
        "description": "Python fuels my passion for AI and IoT projects. With NodeMCU and Arduino, I unleash boundless creativity, crafting captivating applications and pushing technology's limits. Python's power brings my ideas to life, creating innovative, interconnected experiences.",
        "image": "python.png"
      },
      {
        "name": "Git",
        "description": "I use Git for almost all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image": "git.jpg"
      },
      {
        "name": "c#",
        "description": "c# was one of my first programming language that I started using in college years ago. I used it with asp.net /core to bulide desktop and web apps.",
        "image": "c.jpg"
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for almost all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image": "git.jpg"
      },
      {
        "name": "Node JS",
        "description": "Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with ReactJS-based and flutter projects",
        "image": "node.jpg"
      },

      {
        "name": "React Js",
        "description": "I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website and i will use it to make many more  ",
        "image": "react.jpg"
      },
      {
        "name": "WordPress",
        "description": "I admire WordPress for its versatility and user-friendly interface, enabling me to create beautiful websites effortlessly. With its intuitive features, I can bring my creative ideas to life with ease",
        "image": "WordPress.png"
      },

      {
        "name": "Asp Core",
        "description": "Asp Core one of my first framework that i used in college or work ,Although it is not the most practical but it will always have its place in my heart.",
        "image": "asp.png"
      },

      {
        "name": "MongoDB",
        "description": " MongoDB may not be my top choice, but I find it fun to play around with. Its document-oriented approach allows for flexible data exploration and storage. Despite my reservations, I appreciate MongoDB's versatility and the opportunity it offers for experimentation and discovery",
        "image": "mongo.jpg"
      },
      {
        "name": "Django",
        "description": "Django's rising popularity, coupled with AI advancements, empowers me to leverage Python's capabilities in my applications. With Django, I seamlessly integrate powerful AI features, unlocking endless possibilities for intelligent and innovative solutions",
        "image": "Django.png"
      },
      {
        "name": "mysql db",
        "description": "I am truly enamored by MySQL for its power in designing ERDs, allowing me to effortlessly discern table relationships. This proficiency has equipped me to optimize database structures, ensuring efficient data organization and system performance ",
        "image": "mysql.png"
      }
    ],
    "skillshardware": [
      {
        "name": "arduino",
        "description": "Arduino fuels my creativity with its endless possibilities. Through Arduino, I bring my ideas to life, creating captivating and interactive projects that push the boundaries of innovation",
        "image": "arduino.png"
      },
      {
        "name": "raspberry pi",
        "description": "Raspberry Pi is a game-changer, revolutionizing the world of DIY projects. With its compact size and impressive capabilities, Raspberry Pi empowers me to explore new frontiers, creating innovative and versatile solutions with ease.",
        "image": "raspberrypi.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Al Saham Al Asfar Typing Center",
        "category": "Al Saham Al Asfar Typing Center (ASATC) is a government transaction center that offers services related to visas, permits, and regulatory requirements for individuals and businesses in the United Arab Emirates",
        "image": "alsahm.png",
        "url": "https://alsahamtypingcenter.ae/"
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Original Thai Food",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "original-thai-food.jpg",
        "url": "https://original-thai-food.herokuapp.com/index.html"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": "https://github.com/tbakerx/react-resume-template"
      },
      {
        "title": "Smirkspace",
        "category": "(MVP Only) A React and Meteor based chat University project.",
        "image": "smirkspace.jpg",
        "url": "http://www.smirkspace.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I have had the opportunity to play with MJ on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude.",
        "user": "karim benzema"
      }
    ]
  }
}
